// Напишите программу, чтобы она выдавала его квадрат(число умноженное само на себяя)
//например 4 - 16


int number = int.Parse(Console.ReadLine());

Console.WriteLine(" Вы ввели число -    ");
Console.WriteLine(number);

int result = number * number;

Console.WriteLine(result);
